# All Upper I >< 
# Все ли символы написаны заглавными буквами ? 
# Elementary  <>
# Русский bool string --
# ___________________________________________________________________________________
# Elementary
# DE EN FR JA PL Русский UK ZH-HANS

# Проверить все ли символы в строке являются заглавными. 
# Если строка пустая или в ней нет букв - функция должна вернуть True.

# Входные данные: Строка.
# Выходные данные: Логический тип.

# Пример:
assert is_all_upper("ALL UPPER") == True
assert is_all_upper("all lower") == False
assert is_all_upper("mixed UPPER and lower") == False
assert is_all_upper("") == True

# Условия: a-z, A-Z, 1-9 и пробелы
# ___________________________________________________________________________________
# SOLUTION <>

# <><><><><> Best "Clear" Solution <><><><><>
# <><><><><> Best "Creative" Solution <><><><><>
# <><><><><> Best "Speedy" Solution <><><><><>
# <><><><><> Best "3rd party" Solution <><><><><>
# <><><><><> Uncategorized <><><><><>
# ___________________________________________________________________________________
