# Duplicate Zeros >< 
# Слопайте все пончики... упс, удвойте все нули в списке ? 
# Elementary+ <>
# Russian list --
# ___________________________________________________________________________________
# Elementary+
# EN Russian UK

# "Иногда нули напоминают очень вкусные пончики. И каждый раз, доедая пончик, нам хочется ещё один, а потом ещё, и ещё..."

# Перед вами список целых чисел. 
# Ваша задача в этой миссии – продублировать (..., 🍩, ... --> ..., 🍩, 🍩, ...) 
# все нули в данном списке (думайте о пончиках ;-P) и вернуть в виде любого итерируемого объекта. Посмотрим на пример:
# [1, 0, 2, 0] -> [1, 0, 0, 2, 0, 0]
    
# Входные данные: Список целых чисел.
# Выходные данные: Список или другой итерируемый объект (кортеж, генератор, итератор) из целых чисел.

# Примеры:
# assert list(duplicate_zeros([1, 0, 2, 3, 0, 4, 5, 0])) == [
#   1,
#   0,
#   0,
#   2,
#   3,
#   0,
#   0,
#   4,
#   5,
#   0,
#   0,
# ]
# assert list(duplicate_zeros([0, 0, 0, 0])) == [0, 0, 0, 0, 0, 0, 0, 0]
# assert list(duplicate_zeros([100, 10, 0, 101, 1000])) == [100, 10, 0, 0, 101, 1000]

# Если вы прошли миссию, можете со спокойной душой насладиться 🍩!=)

# ___________________________________________________________________________________
# SOLUTION 16. <>
from collections.abc import Iterable


def duplicate_zeros(donuts: list[int]) -> Iterable[int]:
    idx = 0
    new_list = []
    for el in donuts:
        new_list.append(el)
        if el == 0:
            new_list.append(0)
    return new_list
            
print("Example:")
print(list(duplicate_zeros([1, 0, 2, 3, 0, 4, 5, 0])))

# These "asserts" are used for self-checking
assert list(duplicate_zeros([1, 0, 2, 3, 0, 4, 5, 0])) == [
    1,
    0,
    0,
    2,
    3,
    0,
    0,
    4,
    5,
    0,
    0,
]
assert list(duplicate_zeros([0, 0, 0, 0])) == [0, 0, 0, 0, 0, 0, 0, 0]
assert list(duplicate_zeros([100, 10, 0, 101, 1000])) == [100, 10, 0, 0, 101, 1000]


# <><><><><> Best "Clear" Solution <><><><><>
# <><><><><> Best "Creative" Solution <><><><><>
# <><><><><> Best "Speedy" Solution <><><><><>
# <><><><><> Best "3rd party" Solution <><><><><>
# <><><><><> Uncategorized <><><><><>
# ___________________________________________________________________________________
